# CanCategoryBeHiddenTemporary Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..CanCategoryBeHiddenTemporary Method
View Class See Also
---
Check if category can be temporarily hidden in the view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool CanCategoryBeHiddenTemporary(
	ElementId elementId
)
```

Visual Basic
---
```text
Public Function CanCategoryBeHiddenTemporary ( _
	elementId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool CanCategoryBeHiddenTemporary(
	ElementId^ elementId
)
```

# ### Parameters
elementId
    Type: Autodesk.Revit.DB..::..ElementId Id of the category to be checked
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
View Class
Autodesk.Revit.DB Namespace